---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.TrussCurveType.TopChord
enum: Autodesk.Revit.DB.Structure.TrussCurveType
source: html/fa60989a-560f-93d2-cbef-5ab2e35a4fb6.htm
---
# Autodesk.Revit.DB.Structure.TrussCurveType.TopChord